TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/xbar.h
#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setOutputMuxConfig().
//
//*****************************************************************************
typedef enum
{

	//
	//OUTPUTXBAR
	//
	XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH		 = 0x0000,	//!OUT MUX00 CMPSS1 CTRIPOUTH
	XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH_OR_L		 = 0x0001,	//!OUT MUX00 CMPSS1 CTRIPOUTH OR L
	XBAR_OUT_MUX00_ADCAEVT1		 = 0x0002,	//!OUT MUX00 ADCAEVT1
	XBAR_OUT_MUX00_ECAP1_OUT		 = 0x0003,	//!OUT MUX00 ECAP1 OUT
	XBAR_OUT_MUX01_CMPSS1_CTRIPOUTL		 = 0x0200,	//!OUT MUX01 CMPSS1 CTRIPOUTL
	XBAR_OUT_MUX01_INPUTXBAR1		 = 0x0201,	//!OUT MUX01 INPUTXBAR1
	XBAR_OUT_MUX01_CLB1_OUT4		 = 0x0202,	//!OUT MUX01 CLB1 OUT4
	XBAR_OUT_MUX01_ADCCEVT1		 = 0x0203,	//!OUT MUX01 ADCCEVT1
	XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH		 = 0x0400,	//!OUT MUX02 CMPSS2 CTRIPOUTH
	XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH_OR_L		 = 0x0401,	//!OUT MUX02 CMPSS2 CTRIPOUTH OR L
	XBAR_OUT_MUX02_ADCAEVT2		 = 0x0402,	//!OUT MUX02 ADCAEVT2
	XBAR_OUT_MUX02_ECAP2_OUT		 = 0x0403,	//!OUT MUX02 ECAP2 OUT
	XBAR_OUT_MUX03_CMPSS2_CTRIPOUTL		 = 0x0600,	//!OUT MUX03 CMPSS2 CTRIPOUTL
	XBAR_OUT_MUX03_INPUTXBAR2		 = 0x0601,	//!OUT MUX03 INPUTXBAR2
	XBAR_OUT_MUX03_CLB1_OUT5		 = 0x0602,	//!OUT MUX03 CLB1 OUT5
	XBAR_OUT_MUX03_ADCCEVT2		 = 0x0603,	//!OUT MUX03 ADCCEVT2
	XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH		 = 0x0800,	//!OUT MUX04 CMPSS3 CTRIPOUTH
	XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH_OR_L		 = 0x0801,	//!OUT MUX04 CMPSS3 CTRIPOUTH OR L
	XBAR_OUT_MUX04_ADCAEVT3		 = 0x0802,	//!OUT MUX04 ADCAEVT3
	XBAR_OUT_MUX05_CMPSS3_CTRIPOUTL		 = 0x0A00,	//!OUT MUX05 CMPSS3 CTRIPOUTL
	XBAR_OUT_MUX05_INPUTXBAR3		 = 0x0A01,	//!OUT MUX05 INPUTXBAR3
	XBAR_OUT_MUX05_CLB2_OUT4		 = 0x0A02,	//!OUT MUX05 CLB2 OUT4
	XBAR_OUT_MUX05_ADCCEVT3		 = 0x0A03,	//!OUT MUX05 ADCCEVT3
	XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH		 = 0x0C00,	//!OUT MUX06 CMPSS4 CTRIPOUTH
	XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH_OR_L		 = 0x0C01,	//!OUT MUX06 CMPSS4 CTRIPOUTH OR L
	XBAR_OUT_MUX06_ADCAEVT4		 = 0x0C02,	//!OUT MUX06 ADCAEVT4
	XBAR_OUT_MUX07_CMPSS4_CTRIPOUTL		 = 0x0E00,	//!OUT MUX07 CMPSS4 CTRIPOUTL
	XBAR_OUT_MUX07_INPUTXBAR4		 = 0x0E01,	//!OUT MUX07 INPUTXBAR4
	XBAR_OUT_MUX07_CLB2_OUT5		 = 0x0E02,	//!OUT MUX07 CLB2 OUT5
	XBAR_OUT_MUX07_ADCCEVT4		 = 0x0E03,	//!OUT MUX07 ADCCEVT4
	XBAR_OUT_MUX08_ADCBEVT1		 = 0x1002,	//!OUT MUX08 ADCBEVT1
	XBAR_OUT_MUX09_INPUTXBAR5		 = 0x1201,	//!OUT MUX09 INPUTXBAR5
	XBAR_OUT_MUX09_ADCDEVT1		 = 0x1203,	//!OUT MUX09 ADCDEVT1
	XBAR_OUT_MUX10_ADCBEVT2		 = 0x1402,	//!OUT MUX10 ADCBEVT2
	XBAR_OUT_MUX11_INPUTXBAR6		 = 0x1601,	//!OUT MUX11 INPUTXBAR6
	XBAR_OUT_MUX11_ADCDEVT2		 = 0x1603,	//!OUT MUX11 ADCDEVT2
	XBAR_OUT_MUX12_ADCBEVT3		 = 0x1802,	//!OUT MUX12 ADCBEVT3
	XBAR_OUT_MUX13_ADCSOCA		 = 0x1A01,	//!OUT MUX13 ADCSOCA
	XBAR_OUT_MUX13_ADCDEVT3		 = 0x1A03,	//!OUT MUX13 ADCDEVT3
	XBAR_OUT_MUX14_ADCBEVT4		 = 0x1C02,	//!OUT MUX14 ADCBEVT4
	XBAR_OUT_MUX14_EXTSYNCOUT		 = 0x1C03,	//!OUT MUX14 EXTSYNCOUT
	XBAR_OUT_MUX15_ADCSOCB		 = 0x1E01,	//!OUT MUX15 ADCSOCB
	XBAR_OUT_MUX15_ADCDEVT4		 = 0x1E03,	//!OUT MUX15 ADCDEVT4
	XBAR_OUT_MUX16_ADCEEVT1		 = 0x2002,	//!OUT MUX16 ADCEEVT1
	XBAR_OUT_MUX17_CLAHALT		 = 0x2203,
	XBAR_OUT_MUX18_ADCEEVT2		 = 0x2402,	//!OUT MUX18 ADCEEVT2
	XBAR_OUT_MUX19_ERRSTS		 = 0x2603,	//!OUT MUX19 ERRSTS
	XBAR_OUT_MUX20_ADCEEVT3		 = 0x2802,	//!OUT MUX20 ADCEEVT3
	XBAR_OUT_MUX21_FSIA_RX_TRIG2		 = 0x2A03,	//!OUT MUX21 FSIA RX TRIG2
	XBAR_OUT_MUX22_ADCEEVT4		 = 0x2C02,	//!OUT MUX22 ADCEEVT4
	XBAR_OUT_MUX23_ADCA_EXTMUXSEL0		 = 0x2E01,	//!OUT MUX23 ADCA EXTMUXSEL0
	XBAR_OUT_MUX23_ADCC_EXTMUXSEL0		 = 0x2E02,	//!OUT MUX23 ADCC EXTMUXSEL0
	XBAR_OUT_MUX23_ADCE_EXTMUXSEL0		 = 0x2E03,	//!OUT MUX23 ADCE EXTMUXSEL0
	XBAR_OUT_MUX24_ADCA_EXTMUXSEL1		 = 0x3001,	//!OUT MUX24 ADCA EXTMUXSEL1
	XBAR_OUT_MUX24_ADCC_EXTMUXSEL1		 = 0x3002,	//!OUT MUX24 ADCC EXTMUXSEL1
	XBAR_OUT_MUX24_ADCE_EXTMUXSEL1		 = 0x3003,	//!OUT MUX24 ADCE EXTMUXSEL1
	XBAR_OUT_MUX25_ADCA_EXTMUXSEL2		 = 0x3201,	//!OUT MUX25 ADCA EXTMUXSEL2
	XBAR_OUT_MUX25_ADCC_EXTMUXSEL2		 = 0x3202,	//!OUT MUX25 ADCC EXTMUXSEL2
	XBAR_OUT_MUX25_ADCE_EXTMUXSEL2		 = 0x3203,	//!OUT MUX25 ADCE EXTMUXSEL2
	XBAR_OUT_MUX26_ADCA_EXTMUXSEL3		 = 0x3401,	//!OUT MUX26 ADCA EXTMUXSEL3
	XBAR_OUT_MUX26_ADCC_EXTMUXSEL3		 = 0x3402,	//!OUT MUX26 ADCC EXTMUXSEL3
	XBAR_OUT_MUX26_ADCE_EXTMUXSEL3		 = 0x3403,	//!OUT MUX26 ADCE EXTMUXSEL3
	XBAR_OUT_MUX27_ADCB_EXTMUXSEL0		 = 0x3601,	//!OUT MUX27 ADCB EXTMUXSEL0
	XBAR_OUT_MUX27_ADCD_EXTMUXSEL0		 = 0x3602,	//!OUT MUX27 ADCD EXTMUXSEL0
	XBAR_OUT_MUX28_ADCB_EXTMUXSEL1		 = 0x3801,	//!OUT MUX28 ADCB EXTMUXSEL1
	XBAR_OUT_MUX28_ADCD_EXTMUXSEL1		 = 0x3802,	//!OUT MUX28 ADCD EXTMUXSEL1
	XBAR_OUT_MUX29_ADCB_EXTMUXSEL2		 = 0x3A01,	//!OUT MUX29 ADCB EXTMUXSEL2
	XBAR_OUT_MUX29_ADCD_EXTMUXSEL2		 = 0x3A02,	//!OUT MUX29 ADCD EXTMUXSEL2
	XBAR_OUT_MUX30_ADCB_EXTMUXSEL3		 = 0x3C01,	//!OUT MUX30 ADCB EXTMUXSEL3
	XBAR_OUT_MUX30_ADCD_EXTMUXSEL3		 = 0x3C02,	//!OUT MUX30 ADCD EXTMUXSEL3
	XBAR_OUT_MUX30_EPG1_OUT0		 = 0x3C03,	//!OUT MUX30 EPG1 OUT0
	XBAR_OUT_MUX31_ERRSTS		 = 0x3E02,	//!OUT MUX31 ERRSTS
	XBAR_OUT_MUX31_EPG1_OUT1		 = 0x3E03,	//!OUT MUX31 EPG1 OUT1

	//
	//CLBOUTPUTXBAR
	//
	XBAR_OUT_MUX00_CLB1_OUT0		 = 0x0000,
	XBAR_OUT_MUX00_XTRIP_OUT1		 = 0x0003,
	XBAR_OUT_MUX01_CLB1_OUT1		 = 0x0200,
	XBAR_OUT_MUX01_XTRIP_OUT2		 = 0x0203,
	XBAR_OUT_MUX02_CLB1_OUT2		 = 0x0400,
	XBAR_OUT_MUX03_CLB1_OUT3		 = 0x0600,
	XBAR_OUT_MUX04_CLB1_OUT4		 = 0x0800,
	XBAR_OUT_MUX05_CLB1_OUT5		 = 0x0A00,
	XBAR_OUT_MUX06_CLB1_OUT6		 = 0x0C00,
	XBAR_OUT_MUX07_CLB1_OUT7		 = 0x0E00,
	XBAR_OUT_MUX08_CLB2_OUT0		 = 0x1000,
	XBAR_OUT_MUX08_XTRIP_OUT3		 = 0x1003,
	XBAR_OUT_MUX09_CLB2_OUT1		 = 0x1200,
	XBAR_OUT_MUX09_XTRIP_OUT4		 = 0x1203,
	XBAR_OUT_MUX10_CLB2_OUT2		 = 0x1400,
	XBAR_OUT_MUX11_CLB2_OUT3		 = 0x1600,
	XBAR_OUT_MUX12_CLB2_OUT4		 = 0x1800,
	XBAR_OUT_MUX13_CLB2_OUT5		 = 0x1A00,
	XBAR_OUT_MUX14_CLB2_OUT6		 = 0x1C00,
	XBAR_OUT_MUX15_CLB2_OUT7		 = 0x1E00,
	XBAR_OUT_MUX16_XTRIP_OUT5		 = 0x2003,
	XBAR_OUT_MUX17_XTRIP_OUT6		 = 0x2203,
	XBAR_OUT_MUX24_XTRIP_OUT7		 = 0x3003,
	XBAR_OUT_MUX25_XTRIP_OUT8		 = 0x3203,
	XBAR_OUT_MUX30_EPG1_OUT2		 = 0x3C03,
	XBAR_OUT_MUX31_EPG1_OUT3		 = 0x3E03
} XBAR_OutputMuxConfig;


//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setEPWMMuxConfig().
//
//*****************************************************************************
typedef enum
{
	XBAR_EPWM_MUX00_CMPSS1_CTRIPH		 = 0x0000,	//!EPWM MUX00 CMPSS1 CTRIPH
	XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L		 = 0x0001,	//!EPWM MUX00 CMPSS1 CTRIPH OR L
	XBAR_EPWM_MUX00_ADCAEVT1		 = 0x0002,	//!EPWM MUX00 ADCAEVT1
	XBAR_EPWM_MUX00_ECAP1_OUT		 = 0x0003,	//!EPWM MUX00 ECAP1 OUT
	XBAR_EPWM_MUX02_CMPSS2_CTRIPH		 = 0x0400,	//!EPWM MUX02 CMPSS2 CTRIPH
	XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L		 = 0x0401,	//!EPWM MUX02 CMPSS2 CTRIPH OR L
	XBAR_EPWM_MUX02_ADCAEVT2		 = 0x0402,	//!EPWM MUX02 ADCAEVT2
	XBAR_EPWM_MUX02_ECAP2_OUT		 = 0x0403,	//!EPWM MUX02 ECAP2 OUT
	XBAR_EPWM_MUX04_CMPSS3_CTRIPH		 = 0x0800,	//!EPWM MUX04 CMPSS3 CTRIPH
	XBAR_EPWM_MUX04_CMPSS3_CTRIPH_OR_L		 = 0x0801,	//!EPWM MUX04 CMPSS3 CTRIPH OR L
	XBAR_EPWM_MUX04_ADCAEVT3		 = 0x0802,	//!EPWM MUX04 ADCAEVT3
	XBAR_EPWM_MUX06_CMPSS4_CTRIPH		 = 0x0C00,	//!EPWM MUX06 CMPSS4 CTRIPH
	XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L		 = 0x0C01,	//!EPWM MUX06 CMPSS4 CTRIPH OR L
	XBAR_EPWM_MUX06_ADCAEVT4		 = 0x0C02,	//!EPWM MUX06 ADCAEVT4
	XBAR_EPWM_MUX08_ADCBEVT1		 = 0x1002,	//!EPWM MUX08 ADCBEVT1
	XBAR_EPWM_MUX10_ADCBEVT2		 = 0x1402,	//!EPWM MUX10 ADCBEVT2
	XBAR_EPWM_MUX12_ADCBEVT3		 = 0x1802,	//!EPWM MUX12 ADCBEVT3
	XBAR_EPWM_MUX14_ADCBEVT4		 = 0x1C02,	//!EPWM MUX14 ADCBEVT4
	XBAR_EPWM_MUX14_EXTSYNCOUT		 = 0x1C03,	//!EPWM MUX14 EXTSYNCOUT
	XBAR_EPWM_MUX16_ADCEEVT1		 = 0x2002,	//!EPWM MUX16 ADCEEVT1
	XBAR_EPWM_MUX18_ADCEEVT2		 = 0x2402,	//!EPWM MUX18 ADCEEVT2
	XBAR_EPWM_MUX20_ADCEEVT3		 = 0x2802,	//!EPWM MUX20 ADCEEVT3
	XBAR_EPWM_MUX20_FSIA_RX_TRIG1		 = 0x2803,	//!EPWM MUX20 FSIA RX TRIG1
	XBAR_EPWM_MUX22_ADCEEVT4		 = 0x2C02,	//!EPWM MUX22 ADCEEVT4
	XBAR_EPWM_MUX01_CMPSS1_CTRIPL		 = 0x0200,	//!EPWM MUX01 CMPSS1 CTRIPL
	XBAR_EPWM_MUX01_INPUTXBAR1_INPUT1		 = 0x0201,	//!EPWM MUX01 INPUTXBAR1 INPUT1
	XBAR_EPWM_MUX01_CLB1_OUT4		 = 0x0202,	//!EPWM MUX01 CLB1 OUT4
	XBAR_EPWM_MUX01_ADCCEVT1		 = 0x0203,	//!EPWM MUX01 ADCCEVT1
	XBAR_EPWM_MUX03_CMPSS2_CTRIPL		 = 0x0600,	//!EPWM MUX03 CMPSS2 CTRIPL
	XBAR_EPWM_MUX03_INPUTXBAR1_INPUT2		 = 0x0601,	//!EPWM MUX03 INPUTXBAR1 INPUT2
	XBAR_EPWM_MUX03_CLB1_OUT5		 = 0x0602,	//!EPWM MUX03 CLB1 OUT5
	XBAR_EPWM_MUX03_ADCCEVT2		 = 0x0603,	//!EPWM MUX03 ADCCEVT2
	XBAR_EPWM_MUX05_CMPSS3_CTRIPL		 = 0x0A00,	//!EPWM MUX05 CMPSS3 CTRIPL
	XBAR_EPWM_MUX05_INPUTXBAR1_INPUT3		 = 0x0A01,	//!EPWM MUX05 INPUTXBAR1 INPUT3
	XBAR_EPWM_MUX05_CLB2_OUT4		 = 0x0A02,	//!EPWM MUX05 CLB2 OUT4
	XBAR_EPWM_MUX05_ADCCEVT3		 = 0x0A03,	//!EPWM MUX05 ADCCEVT3
	XBAR_EPWM_MUX07_CMPSS4_CTRIPL		 = 0x0E00,	//!EPWM MUX07 CMPSS4 CTRIPL
	XBAR_EPWM_MUX07_INPUTXBAR1_INPUT4		 = 0x0E01,	//!EPWM MUX07 INPUTXBAR1 INPUT4
	XBAR_EPWM_MUX07_CLB2_OUT5		 = 0x0E02,	//!EPWM MUX07 CLB2 OUT5
	XBAR_EPWM_MUX07_ADCCEVT4		 = 0x0E03,	//!EPWM MUX07 ADCCEVT4
	XBAR_EPWM_MUX23_INPUTXBAR1_INPUT10		 = 0x2E01,	//!EPWM MUX23 INPUTXBAR1 INPUT10
	XBAR_EPWM_MUX23_INPUTXBAR2_INPUT10		 = 0x2E02,	//!EPWM MUX23 INPUTXBAR2 INPUT10
	XBAR_EPWM_MUX17_INPUTXBAR1_INPUT7		 = 0x2201,	//!EPWM MUX17 INPUTXBAR1 INPUT7
	XBAR_EPWM_MUX17_INPUTXBAR2_INPUT7		 = 0x2202,	//!EPWM MUX17 INPUTXBAR2 INPUT7
	XBAR_EPWM_MUX17_CLAHALT		 = 0x2203,	//!EPWM MUX17 CLAHALT
	XBAR_EPWM_MUX19_INPUTXBAR1_INPUT8		 = 0x2601,	//!EPWM MUX19 INPUTXBAR1 INPUT8
	XBAR_EPWM_MUX19_INPUTXBAR2_INPUT8		 = 0x2602,	//!EPWM MUX19 INPUTXBAR2 INPUT8
	XBAR_EPWM_MUX19_ERRORSTS		 = 0x2603,	//!EPWM MUX19 ERRORSTS
	XBAR_EPWM_MUX21_INPUTXBAR1_INPUT9		 = 0x2A01,	//!EPWM MUX21 INPUTXBAR1 INPUT9
	XBAR_EPWM_MUX21_INPUTXBAR2_INPUT9		 = 0x2A02,	//!EPWM MUX21 INPUTXBAR2 INPUT9
	XBAR_EPWM_MUX31_INPUTXBAR1_INPUT14		 = 0x3E01,	//!EPWM MUX31 INPUTXBAR1 INPUT14
	XBAR_EPWM_MUX31_ERRORSTS		 = 0x3E02,	//!EPWM MUX31 ERRORSTS
	XBAR_EPWM_MUX31_INPUTXBAR2_INPUT14		 = 0x3E03,	//!EPWM MUX31 INPUTXBAR2 INPUT14
	XBAR_EPWM_MUX25_INPUTXBAR1_INPUT11		 = 0x3201,	//!EPWM MUX25 INPUTXBAR1 INPUT11
	XBAR_EPWM_MUX25_MCANA_FEVT0		 = 0x3202,	//!EPWM MUX25 MCANA FEVT0
	XBAR_EPWM_MUX25_INPUTXBAR2_INPUT11		 = 0x3203,	//!EPWM MUX25 INPUTXBAR2 INPUT11
	XBAR_EPWM_MUX27_INPUTXBAR1_INPUT12		 = 0x3601,	//!EPWM MUX27 INPUTXBAR1 INPUT12
	XBAR_EPWM_MUX27_MCANA_FEVT1		 = 0x3602,	//!EPWM MUX27 MCANA FEVT1
	XBAR_EPWM_MUX27_INPUTXBAR2_INPUT12		 = 0x3603,	//!EPWM MUX27 INPUTXBAR2 INPUT12
	XBAR_EPWM_MUX29_INPUTXBAR1_INPUT13		 = 0x3A01,	//!EPWM MUX29 INPUTXBAR1 INPUT13
	XBAR_EPWM_MUX29_MCANA_FEVT2		 = 0x3A02,	//!EPWM MUX29 MCANA FEVT2
	XBAR_EPWM_MUX29_INPUTXBAR2_INPUT13		 = 0x3A03,	//!EPWM MUX29 INPUTXBAR2 INPUT13
	XBAR_EPWM_MUX09_INPUTXBAR1_INPUT5		 = 0x1201,	//!EPWM MUX09 INPUTXBAR1 INPUT5
	XBAR_EPWM_MUX09_ADCDEVT1		 = 0x1203,	//!EPWM MUX09 ADCDEVT1
	XBAR_EPWM_MUX11_INPUTXBAR1_INPUT6		 = 0x1601,	//!EPWM MUX11 INPUTXBAR1 INPUT6
	XBAR_EPWM_MUX11_ADCDEVT2		 = 0x1603,	//!EPWM MUX11 ADCDEVT2
	XBAR_EPWM_MUX13_ADCSOCA		 = 0x1A01,	//!EPWM MUX13 ADCSOCA
	XBAR_EPWM_MUX13_ADCDEVT3		 = 0x1A03,	//!EPWM MUX13 ADCDEVT3
	XBAR_EPWM_MUX15_ADCSOCB		 = 0x1E01,	//!EPWM MUX15 ADCSOCB
	XBAR_EPWM_MUX15_ADCDEVT4		 = 0x1E03,	//!EPWM MUX15 ADCDEVT4
	XBAR_EPWM_MUX26_MCANB_FEVT0		 = 0x3403,	//!EPWM MUX26 MCANB FEVT0
	XBAR_EPWM_MUX28_MCANB_FEVT1		 = 0x3803,	//!EPWM MUX28 MCANB FEVT1
	XBAR_EPWM_MUX30_MCANB_FEVT2		 = 0x3C03	//!EPWM MUX30 MCANB FEVT2
} XBAR_EPWMMuxConfig;


//*****************************************************************************
//
// The following values define the muxConfig parameter for
// XBAR_setCLBMuxConfig().
//
//*****************************************************************************
typedef enum
{
	XBAR_CLB_MUX00_CMPSS1_CTRIPH		 = 0x0000,	//!CLB MUX00 CMPSS1 CTRIPH
	XBAR_CLB_MUX00_CMPSS1_CTRIPH_OR_L		 = 0x0001,	//!CLB MUX00 CMPSS1 CTRIPH OR L
	XBAR_CLB_MUX00_ADCAEVT1		 = 0x0002,	//!CLB MUX00 ADCAEVT1
	XBAR_CLB_MUX00_ECAP1_OUT		 = 0x0003,	//!CLB MUX00 ECAP1 OUT
	XBAR_CLB_MUX01_CMPSS1_CTRIPL		 = 0x0200,	//!CLB MUX01 CMPSS1 CTRIPL
	XBAR_CLB_MUX01_INPUTXBAR1_INPUT1		 = 0x0201,	//!CLB MUX01 INPUTXBAR1 INPUT1
	XBAR_CLB_MUX01_CLB1_OUT4		 = 0x0202,	//!CLB MUX01 CLB1 OUT4
	XBAR_CLB_MUX01_ADCCEVT1		 = 0x0203,	//!CLB MUX01 ADCCEVT1
	XBAR_CLB_MUX02_CMPSS2_CTRIPH		 = 0x0400,	//!CLB MUX02 CMPSS2 CTRIPH
	XBAR_CLB_MUX02_CMPSS2_CTRIPH_OR_L		 = 0x0401,	//!CLB MUX02 CMPSS2 CTRIPH OR L
	XBAR_CLB_MUX02_ADCAEVT2		 = 0x0402,	//!CLB MUX02 ADCAEVT2
	XBAR_CLB_MUX02_ECAP2_OUT		 = 0x0403,	//!CLB MUX02 ECAP2 OUT
	XBAR_CLB_MUX03_CMPSS2_CTRIPL		 = 0x0600,	//!CLB MUX03 CMPSS2 CTRIPL
	XBAR_CLB_MUX03_INPUTXBAR1_INPUT2		 = 0x0601,	//!CLB MUX03 INPUTXBAR1 INPUT2
	XBAR_CLB_MUX03_CLB1_OUT5		 = 0x0602,	//!CLB MUX03 CLB1 OUT5
	XBAR_CLB_MUX03_ADCCEVT2		 = 0x0603,	//!CLB MUX03 ADCCEVT2
	XBAR_CLB_MUX04_CMPSS3_CTRIPH		 = 0x0800,	//!CLB MUX04 CMPSS3 CTRIPH
	XBAR_CLB_MUX04_CMPSS3_CTRIPH_OR_L		 = 0x0801,	//!CLB MUX04 CMPSS3 CTRIPH OR L
	XBAR_CLB_MUX04_ADCAEVT3		 = 0x0802,	//!CLB MUX04 ADCAEVT3
	XBAR_CLB_MUX05_CMPSS3_CTRIPL		 = 0x0A00,	//!CLB MUX05 CMPSS3 CTRIPL
	XBAR_CLB_MUX05_INPUTXBAR1_INPUT3		 = 0x0A01,	//!CLB MUX05 INPUTXBAR1 INPUT3
	XBAR_CLB_MUX05_CLB2_OUT4		 = 0x0A02,	//!CLB MUX05 CLB2 OUT4
	XBAR_CLB_MUX05_ADCCEVT3		 = 0x0A03,	//!CLB MUX05 ADCCEVT3
	XBAR_CLB_MUX06_CMPSS4_CTRIPH		 = 0x0C00,	//!CLB MUX06 CMPSS4 CTRIPH
	XBAR_CLB_MUX06_CMPSS4_CTRIPH_OR_L		 = 0x0C01,	//!CLB MUX06 CMPSS4 CTRIPH OR L
	XBAR_CLB_MUX06_ADCAEVT4		 = 0x0C02,	//!CLB MUX06 ADCAEVT4
	XBAR_CLB_MUX07_CMPSS4_CTRIPL		 = 0x0E00,	//!CLB MUX07 CMPSS4 CTRIPL
	XBAR_CLB_MUX07_INPUTXBAR1_INPUT4		 = 0x0E01,	//!CLB MUX07 INPUTXBAR1 INPUT4
	XBAR_CLB_MUX07_CLB2_OUT5		 = 0x0E02,	//!CLB MUX07 CLB2 OUT5
	XBAR_CLB_MUX07_ADCCEVT4		 = 0x0E03,	//!CLB MUX07 ADCCEVT4
	XBAR_CLB_MUX08_ADCBEVT1		 = 0x1002,	//!CLB MUX08 ADCBEVT1
	XBAR_CLB_MUX09_INPUTXBAR1_INPUT5		 = 0x1201,	//!CLB MUX09 INPUTXBAR1 INPUT5
	XBAR_CLB_MUX09_ADCDEVT1		 = 0x1203,	//!CLB MUX09 ADCDEVT1
	XBAR_CLB_MUX10_ADCBEVT2		 = 0x1402,	//!CLB MUX10 ADCBEVT2
	XBAR_CLB_MUX11_INPUTXBAR1_INPUT6		 = 0x1601,	//!CLB MUX11 INPUTXBAR1 INPUT6
	XBAR_CLB_MUX11_ADCDEVT2		 = 0x1603,	//!CLB MUX11 ADCDEVT2
	XBAR_CLB_MUX12_ADCBEVT3		 = 0x1802,	//!CLB MUX12 ADCBEVT3
	XBAR_CLB_MUX13_ADCSOCA		 = 0x1A01,	//!CLB MUX13 ADCSOCA
	XBAR_CLB_MUX13_ADCDEVT3		 = 0x1A03,	//!CLB MUX13 ADCDEVT3
	XBAR_CLB_MUX14_ADCBEVT4		 = 0x1C02,	//!CLB MUX14 ADCBEVT4
	XBAR_CLB_MUX14_EXTSYNCOUT		 = 0x1C03,	//!CLB MUX14 EXTSYNCOUT
	XBAR_CLB_MUX15_ADCSOCB		 = 0x1E01,	//!CLB MUX15 ADCSOCB
	XBAR_CLB_MUX15_ADCDEVT4		 = 0x1E03,	//!CLB MUX15 ADCDEVT4
	XBAR_CLB_MUX16_FSIA_RX_TRIG2		 = 0x2002,	//!CLB MUX16 FSIA RX TRIG2
	XBAR_CLB_MUX16_FSIA_RX_TRIG3		 = 0x2003,	//!CLB MUX16 FSIA RX TRIG3
	XBAR_CLB_MUX17_INPUTXBAR1_INPUT7		 = 0x2201,	//!CLB MUX17 INPUTXBAR1 INPUT7
	XBAR_CLB_MUX17_ADCEEVT1		 = 0x2202,	//!CLB MUX17 ADCEEVT1
	XBAR_CLB_MUX17_CLAHALT		 = 0x2203,	//!CLB MUX17 CLAHALT
	XBAR_CLB_MUX19_INPUTXBAR1_INPUT8		 = 0x2601,	//!CLB MUX19 INPUTXBAR1 INPUT8
	XBAR_CLB_MUX19_ADCEEVT2		 = 0x2602,	//!CLB MUX19 ADCEEVT2
	XBAR_CLB_MUX19_ERRORSTS		 = 0x2603,	//!CLB MUX19 ERRORSTS
	XBAR_CLB_MUX21_INPUTXBAR1_INPUT9		 = 0x2A01,	//!CLB MUX21 INPUTXBAR1 INPUT9
	XBAR_CLB_MUX21_ADCEEVT3		 = 0x2A02,	//!CLB MUX21 ADCEEVT3
	XBAR_CLB_MUX23_INPUTXBAR1_INPUT10		 = 0x2E01,	//!CLB MUX23 INPUTXBAR1 INPUT10
	XBAR_CLB_MUX23_ADCEEVT4		 = 0x2E02,	//!CLB MUX23 ADCEEVT4
	XBAR_CLB_MUX24_CPU1_ERADEVT8		 = 0x3002,	//!CLB MUX24 CPU1 ERADEVT8
	XBAR_CLB_MUX25_INPUTXBAR1_INPUT11		 = 0x3201,	//!CLB MUX25 INPUTXBAR1 INPUT11
	XBAR_CLB_MUX25_MCANA_FEVT0		 = 0x3202,	//!CLB MUX25 MCANA FEVT0
	XBAR_CLB_MUX26_CPU1_ERADEVT9		 = 0x3402,	//!CLB MUX26 CPU1 ERADEVT9
	XBAR_CLB_MUX26_MCANB_FEVT0		 = 0x3403,	//!CLB MUX26 MCANB FEVT0
	XBAR_CLB_MUX27_INPUTXBAR1_INPUT12		 = 0x3601,	//!CLB MUX27 INPUTXBAR1 INPUT12
	XBAR_CLB_MUX27_MCANA_FEVT1		 = 0x3602,	//!CLB MUX27 MCANA FEVT1
	XBAR_CLB_MUX28_CPU1_ERADEVT10		 = 0x3802,	//!CLB MUX28 CPU1 ERADEVT10
	XBAR_CLB_MUX28_MCANB_FEVT1		 = 0x3803,	//!CLB MUX28 MCANB FEVT1
	XBAR_CLB_MUX29_INPUTXBAR1_INPUT13		 = 0x3A01,	//!CLB MUX29 INPUTXBAR1 INPUT13
	XBAR_CLB_MUX29_MCANA_FEVT2		 = 0x3A02,	//!CLB MUX29 MCANA FEVT2
	XBAR_CLB_MUX30_CPU1_ERADEVT11		 = 0x3C02,	//!CLB MUX30 CPU1 ERADEVT11
	XBAR_CLB_MUX30_MCANB_FEVT2		 = 0x3C03,	//!CLB MUX30 MCANB FEVT2
	XBAR_CLB_MUX31_INPUTXBAR1_INPUT14		 = 0x3E01,	//!CLB MUX31 INPUTXBAR1 INPUT14
	XBAR_CLB_MUX31_ERRORSTS		 = 0x3E02	//!CLB MUX31 ERRORSTS
} XBAR_CLBMuxConfig;



//*****************************************************************************
//
//! The following values define the \e inputFlag parameter for
//! XBAR_getInputFlagStatus() and XBAR_clearInputFlag().
//
//*****************************************************************************
typedef enum
{
    //
    // XBARFLG1
    //
    XBAR_INPUT_FLG_CMPSS1_CTRIPL    = 0x0000,
    XBAR_INPUT_FLG_CMPSS1_CTRIPH    = 0x0001,
    XBAR_INPUT_FLG_CMPSS2_CTRIPL    = 0x0002,
    XBAR_INPUT_FLG_CMPSS2_CTRIPH    = 0x0003,
    XBAR_INPUT_FLG_CMPSS3_CTRIPL    = 0x0004,
    XBAR_INPUT_FLG_CMPSS3_CTRIPH    = 0x0005,
    XBAR_INPUT_FLG_CMPSS4_CTRIPL    = 0x0006,
    XBAR_INPUT_FLG_CMPSS4_CTRIPH    = 0x0007,
    XBAR_INPUT_FLG_CMPSS1_CTRIPOUTL = 0x0010,
    XBAR_INPUT_FLG_CMPSS1_CTRIPOUTH = 0x0011,
    XBAR_INPUT_FLG_CMPSS2_CTRIPOUTL = 0x0012,
    XBAR_INPUT_FLG_CMPSS2_CTRIPOUTH = 0x0013,
    XBAR_INPUT_FLG_CMPSS3_CTRIPOUTL = 0x0014,
    XBAR_INPUT_FLG_CMPSS3_CTRIPOUTH = 0x0015,
    XBAR_INPUT_FLG_CMPSS4_CTRIPOUTL = 0x0016,
    XBAR_INPUT_FLG_CMPSS4_CTRIPOUTH = 0x0017,
    //
    // XBARFLG2
    //
    XBAR_INPUT_FLG_INPUT1           = 0x0100,
    XBAR_INPUT_FLG_INPUT2           = 0x0101,
    XBAR_INPUT_FLG_INPUT3           = 0x0102,
    XBAR_INPUT_FLG_INPUT4           = 0x0103,
    XBAR_INPUT_FLG_INPUT5           = 0x0104,
    XBAR_INPUT_FLG_INPUT6           = 0x0105,
    XBAR_INPUT_FLG_ADCSOCA          = 0x0106,
    XBAR_INPUT_FLG_ADCSOCB          = 0x0107,
    XBAR_INPUT_FLG_INPUT7           = 0x0108,
    XBAR_INPUT_FLG_INPUT8           = 0x0109,
    XBAR_INPUT_FLG_INPUT9           = 0x010A,
    XBAR_INPUT_FLG_INPUT10          = 0x010B,
    XBAR_INPUT_FLG_INPUT11          = 0x010C,
    XBAR_INPUT_FLG_INPUT12          = 0x010D,
    XBAR_INPUT_FLG_INPUT13          = 0x010E,
    XBAR_INPUT_FLG_INPUT14          = 0x010F,
    XBAR_INPUT_FLG_ECAP1_OUT        = 0x0110,
    XBAR_INPUT_FLG_ECAP2_OUT        = 0x0111,
    XBAR_INPUT_FLG_EXTSYNCOUT       = 0x0116,
    XBAR_INPUT_FLG_ADCAEVT1         = 0x0117,
    XBAR_INPUT_FLG_ADCAEVT2         = 0x0118,
    XBAR_INPUT_FLG_ADCAEVT3         = 0x0119,
    XBAR_INPUT_FLG_ADCAEVT4         = 0x011A,
    XBAR_INPUT_FLG_ADCBEVT1         = 0x011B,
    XBAR_INPUT_FLG_ADCBEVT2         = 0x011C,
    XBAR_INPUT_FLG_ADCBEVT3         = 0x011D,
    XBAR_INPUT_FLG_ADCBEVT4         = 0x011E,
    XBAR_INPUT_FLG_ADCCEVT1         = 0x011F,
    //
    // XBARFLG3
    //
    XBAR_INPUT_FLG_ADCCEVT2         = 0x0200,
    XBAR_INPUT_FLG_ADCCEVT3         = 0x0201,
    XBAR_INPUT_FLG_ADCCEVT4         = 0x0202,
    XBAR_INPUT_FLG_ADCDEVT1         = 0x0203,
    XBAR_INPUT_FLG_ADCDEVT2         = 0x0204,
    XBAR_INPUT_FLG_ADCDEVT3         = 0x0205,
    XBAR_INPUT_FLG_ADCDEVT4         = 0x0206,
    XBAR_INPUT_FLG_ADCEEVT1         = 0x020F,
    XBAR_INPUT_FLG_ADCEEVT2         = 0x0210,
    XBAR_INPUT_FLG_ADCEEVT3         = 0x0211,
    XBAR_INPUT_FLG_ADCEEVT4         = 0x0212,
    //
    // XBARFLG4
    //
    XBAR_INPUT_FLG_MCANA_FEVT0      = 0x0309,
    XBAR_INPUT_FLG_MCANA_FEVT1      = 0x030A,
    XBAR_INPUT_FLG_MCANA_FEVT2      = 0x030B,
    XBAR_INPUT_FLG_MCANB_FEVT0      = 0x030C,
    XBAR_INPUT_FLG_MCANB_FEVT1      = 0x030D,
    XBAR_INPUT_FLG_MCANB_FEVT2      = 0x030E,
    XBAR_INPUT_FLG_CLB1_OUT4        = 0x0310,
    XBAR_INPUT_FLG_CLB1_OUT5        = 0x0311,
    XBAR_INPUT_FLG_CLB2_OUT4        = 0x0312,
    XBAR_INPUT_FLG_CLB2_OUT5        = 0x0313,
    XBAR_INPUT_FLG_ERRORSTS_ERROR   = 0x031C,
    XBAR_INPUT_FLG_CLAHALT          = 0x031F,
} XBAR_InputFlag;
#endif

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks a X-BAR base address.
//!
//! \param base is the base address of the X-BAR.
//!
//! This function determines if a X-BAR base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
XBAR_isBaseValid(uint32_t base)
{
    return((base == OUTPUTXBAR_BASE) ||
           (base == CLBOUTPUTXBAR_BASE) || (base == CLBINPUTXBAR_BASE ) ||
           (base == INPUTXBAR_BASE));

